iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/Forms/ФормаВводаДанных/Module.bsl
&НаКлиенте
Процедура ТЧОпоросНомерЖивотногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.ДатаСобытия = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ДанныеПоСвиноматкам = _НастройкиКонфигурацииНаСервере.ПолучитьСписокСвиноматок(ВыбранноеЗначение);
	Если ДанныеПоСвиноматкам.Количество() <> 0 Тогда
		Если ДанныеПоСвиноматкам.Количество() = 1 Тогда
			Запись.НомерЖивотного = ДанныеПоСвиноматкам[0].Значение.НомерЖивотного;
			Запись.ДатаВвода	  = ДанныеПоСвиноматкам[0].Значение.ДатаВвода;
			Запись.КодПороды	  = ДанныеПоСвиноматкам[0].Значение.КодПороды;
		Иначе
			ВыбСтрокаМеню = ВыбратьИзМеню(ДанныеПоСвиноматкам);
			Если ВыбСтрокаМеню <> Неопределено Тогда

				Реквизиты = ВыбСтрокаМеню.Значение;
				Запись.НомерЖивотного = Реквизиты.НомерЖивотного;
				Запись.ДатаВвода	  = Реквизиты.ДатаВвода;
				Запись.КодПороды	  = Реквизиты.КодПороды;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Предупреждение("Свиноматки с таким номер нет");
	КонецЕсли;
	ПолучитьДанныеКоличествоОтъем();
КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросМассаВсегоПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Если Запись.Живорожденные > 0 Тогда
		Запись.СреднийВес = Запись.МассаВсего / Запись.Живорожденные;
	КонецЕсли;
	Элементы.ТЧОпоросКоличествоОтъемышей.ТекстПодвала 	= ТЧДанные.Итог("КоличествоОтъемышей");
	Элементы.ТЧОпоросМассаВсего.ТекстПодвала 			= ТЧДанные.Итог("МассаВсего");
	Элементы.ТЧОпоросСреднийВес.ТекстПодвала 			= ТЧДанные.Итог("СреднийВес");
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧДанные.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОсеменения(Команда)
	Для Каждого Запись Из ТЧДанные Цикл
		Попытка
			СоздатьЗаписьЖурналаОтъемаНаСервере(Запись.ДатаСобытия, Запись.НомерЖивотного, Запись.ДатаВвода,
				Запись.КодМеста, Запись.НомерОпороса, Запись.Мачеха, Запись.КоличествоОтъемышей, Запись.МассаВсего,
				Запись.СреднийВес, Запись.ТолщинаШпика);
			_ОбработкаОповещенияНаКлиенте.ОткрытьФормуСвиноматки(Запись.НомерЖивотного, Запись.ДатаВвода);
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данные внесены для свиноматки " + Запись.НомерЖивотного;
			Сообщение.Сообщить();
		Исключение
			Ошибка = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст =   "--------------------------------------" + Символы.ПС + "Данные не были внесены"
				+ Символы.ПС + Прав(Ошибка, СтрДлина(Ошибка) - СтрНайти(Ошибка, "}", НаправлениеПоиска.СКонца) - 2)
				+ Символы.ПС + "--------------------------------------";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЦикла;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьЖурналаОтъемаНаСервере(Знач ДатаОтъема, Знач НомерЖивотного, Знач ДатаВвода, Знач Место,
	Знач НомерОпороса, Знач Мачеха, Знач КоличествоОтъемышей, Знач МассаВсего, Знач СреднийВес, Знач ТолщинаШпика)

	Перем Записи;

	Записи = РегистрыСведений.ЖурналОтъема.СоздатьМенеджерЗаписи();
	Записи.Период 				= ДатаОтъема;
	Записи.НомерЖивотного 		= НомерЖивотного;
	Записи.ДатаВвода			= ДатаВвода;
	Записи.КодМеста 			= Место;
	Записи.НомерОпороса			= НомерОпороса;
	Записи.Мачеха 				= Мачеха;
	Записи.КоличествоОтъемышей 	= КоличествоОтъемышей;
	Записи.МассаВсего			= МассаВсего;
	Записи.СреднийВес			= СреднийВес;
	Записи.ТолщинаШпика			= ТолщинаШпика;
	Записи.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧОпоросХрякПриИзменении(Элемент)
	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Запись.КодПородыХряк = НомерЖивотногоХрякПриИзмененииНаСервере(Запись.Хряк);
КонецПроцедуры

&НаСервере
Функция НомерЖивотногоХрякПриИзмененииНаСервере(Хряк)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КарточкаВнесенияДанныхСрезПоследних.КодПороды КАК КодПороды
	|ИЗ
	|	РегистрСведений.КарточкаВнесенияДанных.СрезПоследних(, ) КАК КарточкаВнесенияДанныхСрезПоследних
	|ГДЕ
	|	КарточкаВнесенияДанныхСрезПоследних.НомерЖивотного = &НомерЖивотного";

	Запрос.УстановитьПараметр("НомерЖивотного", Хряк);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КодПороды;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ТЧОпоросКоличествоОтъемышейПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТЧОпорос.ТекущиеДанные;
	ТекущиеДанные.СреднийВес = ОКР(ТекущиеДанные.МассаВсего / ТекущиеДанные.КоличествоОтъемышей, 2);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеКоличествоОтъем()

	Перем Запись;

	Запись = Элементы.ТЧОпорос.ТекущиеДанные;
	Элементы.ТЧОпоросНомерЖивотного.ТекстПодвала 		= ТЧДанные.Количество();

КонецПроцедуры

&НаСервере
Процедура ПечатьСпискаНаСервере(ТабДок)

	Перем Колонка, ПострПечать;

	ТаблицаДанные = Новый ТаблицаЗначений;
	ТаблицаДанные = ТЧДанные.Выгрузить();

	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаДанные);
	ПострПечать.Макет = РегистрыСведений.ЖурналОтъема.ПолучитьМакет("Макет"); 
//	ПострПечать.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Интерфейс);
	ПострПечать.Выполнить();
	Для Каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
		Колонка.Представление = ТаблицаДанные.Колонки[Колонка.Имя].Заголовок;
	КонецЦикла;
	ПострПечать.Вывести(ТабДок);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСписка(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСпискаНаСервере(ТабДок);
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры
